const mockSubmissions = [
  {
    id: 1,
    studentName: 'Айдос Нұржанұлы',
    lessonTitle: 'OSI моделі: 7 қабат және олардың рөлі',
    answer:
      'OSI моделінде 7 қабат бар. Әр қабат желідегі байланыстың белгілі бір қызметін орындайды. Мысалы, желілік қабат деректерді бағыттайды, ал қолданбалы қабат қолданушыға жақын жұмыс істейді.',
    status: 'Тексеруді күтуде',
    score: null,
    teacherComment: '',
  },
  {
    id: 2,
    studentName: 'Аружан Мейрамқызы',
    lessonTitle: 'Интернет қалай жұмыс істейді? Желінің негіздері',
    answer:
      'Интернет көптеген құрылғылардан тұратын үлкен желі. Деректер серверден қолданушы құрылғысына арнайы хаттамалар арқылы беріледі.',
    status: 'Тексерілді',
    score: 90,
    teacherComment: 'Жауап жақсы, негізгі ұғымдар дұрыс көрсетілген.',
  },
  {
    id: 3,
    studentName: 'Нұрбек Әлиханұлы',
    lessonTitle: 'Пароль дегеніміз не? Бұзылу тәсілдері',
    answer:
      'Бір парольді барлық жерде қолдану қауіпті. Егер бір сайттан пароль ұрланса, басқа аккаунттар да бұзылуы мүмкін.',
    status: 'Тексеруді күтуде',
    score: null,
    teacherComment: '',
  },
]

export default mockSubmissions